---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelEllipse
source: html/33e32d32-5e9d-9c3b-b299-3b87b105633b.htm
---
# ModelEllipse Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.